#include <stdio.h>
#include <stdlib.h>

int main()
{
int a,b,i,j,sum;            //定义整形变量//
char z;                     //定义字符变量//
int temp=0;                 //定义赋值临时变量//
printf("=================================九九乘法表=================================\n");
printf("============================================================================\n");
for(i=1;i<=9;i++)                    //进行循环语句//
{
	for(j=1;j<=i;j++)                       //进行循环语句//
	{
		printf("%d*%d=%d\t",j,i,j*i);
	}
	printf("\n");
}
printf("============================================================================\n");
printf("============================================================================\n");
printf("\t***********************\n\t*  请进行如下选择:    *\n\t*   A：输数进行运算   *\n\t*   B：退出程序       *\n");
printf("\t***********************\n");
printf("\n您选择的选项是(请选择A或B)： ");
scanf("%c",&z);                                //输入z的值//
switch(z)                                      //分支语句//
{
	case'A':                                         //分支A//
		printf("\n请输入两个整数：\n");
		scanf("%d",&a);
		scanf("%d",&b);
		sum=a*b;
		printf("乘积等于：%d",sum);
		printf("\n============================================================================\n");
		if(b>a)                                      //判断语句//
		{                                         //将a,b值交换//
			temp=a;
			a=b;
			b=temp;
		}
		for(i=1;i<=9;i++)                            //循环语句//
		{
			for(j=1;j<=i;j++)                        //循环语句//
			{
				if(i==a&&j==b)                       //判断语句//
				{
					printf("%d*%d=%-2d  ",b,a,a*b);
				}
				else
				{
					printf("        ");
				}
			}
			printf("\n\n");
		}
		printf("============================================================================\n");
		break;                                       //跳出循环//
	case'B':printf("\n感谢您的使用！\n  GOODBEY\n\n\n");break;
	default:break;                                   //不合条件，跳出循环//
}
return 0;                                            //返回值为0//
}